Tekla.Structures.Geometry3d.Intersection
The Intersection class contains methods for calculating intersections between geometric objects.

Tekla.Structures.Geometry3d.Intersection.LineToLine(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.Line)
Returns a new line segment which is the shortest path between the given lines or null if the lines are
parallel. If the resulting line segment has a length of 0.0, the given lines actually intersect
in 3d space.
line1: The first line to be used.
line2: The second line to be used.
Returns: The shortest line segment between the given lines or null if the lines are parallel.

Tekla.Structures.Geometry3d.Intersection.LineToPlane(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.GeometricPlane)
Returns a new point which is an intersection of the given line and plane or null if the line and the plane are
parallel.
line: The line to be used.
plane: The plane to be used.
Returns: The intersection point or null if no intersection was found.

Tekla.Structures.Geometry3d.Intersection.LineSegmentToPlane(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.GeometricPlane)
Returns a new point which is an intersection of the given line segment and plane or null if
the line segment and the plane are parallel or do not intersect.
lineSegment: The line segment to be used.
plane: The plane to be used.
Returns: The intersection point or null if no intersection was found.

Tekla.Structures.Geometry3d.Intersection.PlaneToPlane(Tekla.Structures.Geometry3d.GeometricPlane,Tekla.Structures.Geometry3d.GeometricPlane)
Returns a new line which is an intersection of the given two planes or null if the planes are
parallel.
plane1: The first plane to be used.
plane2: The second plane to be used.
Returns: The intersection line or null if no intersection was found.

Tekla.Structures.Geometry3d.Intersection.LineToObb(Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.OBB)
Returns a new line segment which is an intersection of the given line and the oriented bounding box
or null if the line and oriented bounding box do not intersect.
line: Line to be used.
obb: Oriented bounding box to be used.
Returns: The intersection line segment or null if no intersection was found.

Tekla.Structures.Geometry3d.Intersection.LineSegmentToObb(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.OBB)
Returns a new line segment which is an intersection of the given line segment and the oriented bounding box
or null if the line segment and oriented bounding box do not intersect.
lineSegment: Line segment to be used.
obb: Oriented bounding box to be used.
Returns: The intersection line segment or null if no intersection was found.

Tekla.Structures.Geometry3d.Intersection.SmallerThanEpsilon(Tekla.Structures.Geometry3d.Vector,System.Double)
Method for zero vector evaluation.
vector: Vector to be evaluated.
epsilon: Epsilon to be used in comparison.
Returns: True if all the vector points are smaller than the given epsilon.